In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={                                          #here keyword goes as feature and values related to it goes as variales
    "name":['harry','rohan','yash'],
    "marks":[204,56,78],
    "city":['Delhi','bareilly','europe' ]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df.to_csv('first.csv', index=False)       #csv file me index wala column nahi chahiye

In [6]:
df.head(2)

    name  marks      city
0  harry    204     Delhi
1  rohan     56  bareilly

In [7]:
df.tail(2)

    name  marks      city
1  rohan     56  bareilly
2   yash     78    europe

In [8]:
df.describe()

            marks
count    3.000000
mean   112.666667
std     79.858208
min     56.000000
25%     67.000000
50%     78.000000
75%    141.000000
max    204.000000

In [ ]:
 #harry = pd.read_csv('filename.csv') to read the csv file into harry
 #harry.index= ['first','second',...] changes first column 0,1,2,3 to first second third,..

In [9]:
ser = pd.Series(np.random.rand(34))

In [10]:
ser

0     0.336377
1     0.298323
2     0.885720
3     0.162261
4     0.382077
5     0.170144
6     0.031782
7     0.935073
8     0.184480
9     0.000080
10    0.669602
11    0.174970
12    0.191134
13    0.425953
14    0.737708
15    0.848022
16    0.161855
17    0.744275
18    0.679962
19    0.042009
20    0.134071
21    0.293216
22    0.230552
23    0.039017
24    0.990872
25    0.380175
26    0.103911
27    0.620577
28    0.396552
29    0.152835
30    0.766557
31    0.951101
32    0.794652
33    0.703269
dtype: float64

In [11]:
newdf = pd.DataFrame(np.random.rand(334,5), np.arange(334))

In [12]:
newdf

            0         1         2         3         4
0    0.859342  0.596967  0.369196  0.658585  0.460590
1    0.318728  0.843719  0.795158  0.283002  0.112944
2    0.805208  0.078164  0.166475  0.904762  0.361594
3    0.781560  0.575670  0.211079  0.348508  0.477460
4    0.474488  0.487058  0.141818  0.605821  0.079767
..        ...       ...       ...       ...       ...
329  0.692229  0.772096  0.528766  0.373418  0.180055
330  0.131327  0.413899  0.375142  0.828992  0.375522
331  0.915746  0.011384  0.998470  0.026963  0.872469
332  0.378487  0.470865  0.049305  0.204995  0.137857
333  0.763795  0.021261  0.272977  0.428939  0.347518

[334 rows x 5 columns]